phase5_2_watercooling/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           |                                                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (-0.05 -0.05 -0.005)   // 0
    ( 0.05 -0.05 -0.005)   // 1
    ( 0.05  0.05 -0.005)   // 2
    (-0.05  0.05 -0.005)   // 3
    (-0.05 -0.05  0.075)   // 4
    ( 0.05 -0.05  0.075)   // 5
    ( 0.05  0.05  0.075)   // 6
    (-0.05  0.05  0.075)   // 7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (20 20 16) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    sides
    {
        type patch;
        faces
        (
            (0 4 7 3)   // -X
            (2 6 5 1)   // +X
            (1 5 4 0)   // -Y
            (3 7 6 2)   // +Y
        );
    }
    bottom
    {
        type wall;
        faces
        (
            (0 3 2 1)   // -Z
        );
    }
    top
    {
        type patch;
        faces
        (
            (4 5 6 7)   // +Z
        );
    }
);

mergeFacesPairs
(
);

// ************************************************************************* //
