phase5_2_watercooling/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    sides
    {
        type            patch;
        nFaces          1280;
        startFace       139228;
    }
    bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1456;
        startFace       140508;
    }
    top
    {
        type            patch;
        nFaces          400;
        startFace       141964;
    }
)

// ************************************************************************* //
